Revit 2024 API
LightGroupManager.GetGroups Method
 Get the set of contained LightGroup objects The set of LightGroup objects
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IList<LightGroup> GetGroups()
Visual Basic
Public Function GetGroups As IList(Of LightGroup)
Visual C++
public:
IList<LightGroup^>^ GetGroups()
See Also
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace